@ECHO OFF

CLS
ECHO Пример №4 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Посмотрим пример использования циклов:
ECHO ----------------------------------------------------------------
ECHO FOR %%i IN ("text1","text2","text3") DO @ECHO %%i 
ECHO ----------------------------------------------------------------
ECHO Результат выполнения команды:
FOR %%i IN ("text1","text2","text3") DO @ECHO %%i
ECHO ----------------------------------------------------------------
PAUSE

CLS
ECHO Пример №4 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Следующий пример использования циклов:
ECHO ----------------------------------------------------------------
ECHO FOR /L %%i IN (1,1,10) DO @ECHO %%i 
ECHO ----------------------------------------------------------------
ECHO Результат выполнения команды:
FOR /L %%i IN (1,1,10) DO @ECHO %%i
ECHO ----------------------------------------------------------------
PAUSE

CLS
ECHO Пример №4 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Следующий пример использования циклов:
ECHO ----------------------------------------------------------------
ECHO FOR /L %%i IN (9,-3,-6) DO @ECHO %%i 
ECHO ----------------------------------------------------------------
ECHO Результат выполнения команды:
FOR /L %%i IN (9,-3,-6) DO @ECHO %%i
ECHO ----------------------------------------------------------------
PAUSE

CLS
ECHO Пример №4 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Просмотр примера окончен.
ECHO Можете приступать к просмору следующего примера.
ECHO ----------------------------------------------------------------
PAUSE
