@ECHO OFF

CLS
ECHO Пример №3 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Посмотрим список переменных окружения с помощью команды:
ECHO ----------------------------------------------------------------
ECHO SET 
ECHO ----------------------------------------------------------------
ECHO Результат выполнения команды:
SET
ECHO ----------------------------------------------------------------
PAUSE

CLS
ECHO Пример №3 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Добавим свою переменную VARIABLE:
ECHO ----------------------------------------------------------------
ECHO SET VARIABLE=value
ECHO ECHO %%VARIABLE%%
ECHO ----------------------------------------------------------------
ECHO Результат выполнения команды:
SET VARIABLE=value
ECHO %VARIABLE%
ECHO ----------------------------------------------------------------
PAUSE

CLS
ECHO Пример №3 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Посмотрим значение VARIABLE в списке переменных окружения:
ECHO ----------------------------------------------------------------
ECHO SET > set.txt
ECHO ----------------------------------------------------------------
ECHO Результат выполнения команды:
SET> set.txt
ECHO ----------------------------------------------------------------
PAUSE

CLS
ECHO Пример №3 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Просмотр примера окончен.
ECHO Можете приступать к просмору следующего примера.
ECHO ----------------------------------------------------------------
PAUSE
