@ECHO OFF

IF "%1"=="ic" GOTO AFTERIC
IF "%1"=="oc" GOTO AFTEROC

ECHO Пример №1 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Для начала очистим экран. 
PAUSE

CLS
ECHO Пример №1 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Выполним несколько внутренних комманд ОС MS DOS. Начнем с команды:
ECHO ----------------------------------------------------------------
ECHO DATE 
ECHO ----------------------------------------------------------------
ECHO Результат выполнения команды:
DATE /T
ECHO ----------------------------------------------------------------
PAUSE

CLS
ECHO Пример №1 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Посмотрим справочную информацию о данной команде
ECHO ----------------------------------------------------------------
ECHO DATE /?
ECHO ----------------------------------------------------------------
ECHO Результат выполнения:
DATE /?
ECHO ----------------------------------------------------------------
ECHO Как видим, предыдущее выполнение команды DATE было вызвано с 
ECHO параметром /T.
PAUSE

CLS
ECHO Пример №1 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Посмотрим справочную информацию еще о нескольких командах
ECHO и попробуем их выполнить:
ECHO ----------------------------------------------------------------
ECHO TIME /?
ECHO ----------------------------------------------------------------
ECHO Результат выполнения:
TIME /?
ECHO ----------------------------------------------------------------
ECHO TIME /T
ECHO ----------------------------------------------------------------
ECHO Результат выполнения:
TIME /T
ECHO ----------------------------------------------------------------
PAUSE

CLS
ECHO Пример №1 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO TYPE /?
ECHO ----------------------------------------------------------------
ECHO Результат выполнения:
TYPE /?
ECHO ----------------------------------------------------------------
ECHO TYPE file.txt
ECHO ----------------------------------------------------------------
ECHO Результат выполнения:
TYPE file.txt
ECHO ----------------------------------------------------------------
PAUSE

CLS
ECHO Пример №1 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO REM /?
ECHO ----------------------------------------------------------------
ECHO Результат выполнения:
REM /?
ECHO ----------------------------------------------------------------
PAUSE

CLS
ECHO Пример №1 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Приведем список внутренних команд MS DOS:
ECHO ----------------------------------------------------------------
ECHO Результат выполнения:
example_02.bat ic R
ECHO ----------------------------------------------------------------
PAUSE

:AFTERIC

CLS
ECHO Пример №1 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Приведем список внешних команд MS DOS:
ECHO ----------------------------------------------------------------
ECHO Результат выполнения:
example_02.cmd oc R
ECHO ----------------------------------------------------------------
PAUSE

:AFTEROC

CLS
ECHO Пример №1 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO В предыдущем примере использовались команды:
ECHO безусловного перехода GOTO 
ECHO команды выполняющй ветвление IF
ECHO ----------------------------------------------------------------
ECHO Приведем сожержимое сценария:
type example_02.bat
ECHO ----------------------------------------------------------------
PAUSE

CLS
ECHO Пример №1 использования bat-файлов в качестве сценариев оболочки
ECHO ----------------------------------------------------------------
ECHO Просмотр примера окончен.
ECHO Можете приступать к просмору следующего примера.
ECHO ----------------------------------------------------------------
PAUSE
